Revit 2027 API
FabricationServiceButton.GetConditionDescription Method
 Gets the description for the condition size range.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetConditionDescription(
	int condition
)
Public Function GetConditionDescription (
	condition As Integer
) As String
public:
String^ GetConditionDescription(
	int condition
)
member GetConditionDescription :
        condition : int -> string
Parameters
condition Int32
 The index of the condition in the service button.
Return Value
String
 A user-defined string that describes the condition range, as defined in the fabrication configuration. For example, this may describe the size of the range or describe the type of fitting.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The index condition is not larger or equal to 0 and less than ConditionCount.
See Also
Reference
FabricationServiceButton Class
Autodesk.Revit.DB Namespace